spec/fixtures/assign_mentor_wizard.dot
digraph AssignMentorWizard {
rankdir = "LR";
fontname = "Arial";
node[ style  =  "rounded,filled" , shape  =  "rect" , color  =  "#666666" , fillcolor  =  "#f9f9f9"];
who_will_be_the_mentor [fillcolor = "#d2f7ef", color = "#00703c", penwidth = "2", label = "who_will_be_the_mentor"];
confirmation [shape = "doublecircle", color = "#aaaaaa", fillcolor = "#f5e7e7", label = "confirmation"];
can_receive_mentor_training [label = "Can Receive Mentor Training"];
which_lead_provider [label = "Which Lead Provider"];
  who_will_be_the_mentor -> can_receive_mentor_training [style = "bold", color = "#222222"];
  which_lead_provider -> confirmation [style = "bold", color = "#222222"];
  can_receive_mentor_training -> which_lead_provider [label = "LP provides?", color = "#00703c", fontcolor = "#00703c", penwidth = "2"];
  can_receive_mentor_training -> confirmation [label = "Else", color = "#d4351c", fontcolor = "#d4351c", style = "dashed"];
}
