spec/fixtures/documentation/mermaid/assign_mentor_wizard.mmd
flowchart TD
  who_will_be_the_mentor["Who Will Be The Mentor"]
  can_receive_mentor_training["Can Receive Mentor Training"]
  which_lead_provider["Which Lead Provider"]
  confirmation["Confirmation"]
  who_will_be_the_mentor --> can_receive_mentor_training
  which_lead_provider --> confirmation
  can_receive_mentor_training -->|LP provides?: ✓| which_lead_provider
  can_receive_mentor_training -->|LP provides?: ✗| confirmation
